
❤ 객체 지향 프로그래밍 (Object Oriented Programming, OPP) 은 무엇인가..

     *객체 : 작용의 대상이 되는 쪽
     *지향하다 : 어떤 목표로 뜻이 쏠리어 향하다.
     
     객체 지향.. 객체를 지향하는 프로그래밍..
     
     프로그래밍에 필요한 데이터를 추상화를 시켜서 상태와 행위를 가지는 객체를 만들고
     그 객체의 상호작용을 활용하여 프로그래밍하는 것..?
     
     다양한 상태와 행위를 가지는 객체들을 조합하고 조합하여 하나의 프로그램으로 만드는 것..??

----------------------------------------------------------------------------------------------------------------------------------------------------
    * 객체란?
    물리적으로 존재하거나(자동차, 책, 사람), 추상적인 것(회사, 날짜) 중에서 자신의 속성과 동작을 가지는 모든 것을 말합니다.
    객체는 속성(필드)과 메소드(동작)로 구성된 자바 객체로 모델링할 수 있다.
    
    [객체간의 관계]
    객체 지향 프로그램에서는 객체는 다른 객체와 다른 객체와 관계를 맺고 있다.
    집합 관계 : 완성품과 부품의 관계
    사용 관계 : 객체가 다른 객체를 사용하는 관계
    상속 관계 : 종류 객체와 구체적인 사물 객체 관계 
    
    [객체지향 프로그래밍]
    부품객체를 만들고 이것들은 하나씩 조립해서 완성된 프로그램을 만드는 기법
    ex) 슬라이딩 배너 (next,prev 버튼, auto 기능, 정지버튼 기능등의 부품 객체를 모두 조립하여 하나의 슬라이딩 객체가 완성
                                   
                                  
                                                                                   출처: https://webclub.tistory.com/155 [Web Club:티스토리]
----------------------------------------------------------------------------------------------------------------------------------------------------
